Proyecto_CLuciana/app/Models/ConsultaModel.php

    public function obtenerConsulta() {
        $query = $this->findAll();
---
SELECT *
FROM `consultas`