Proyecto_CLuciana/app/Models/DetalleVentaModel.php

SELECT *
FROM `detalle_venta`
WHERE `venta_id` = '1'
---
    public function obtenerDetalles($id=null){
        if($id==NULL){
           $query = $this->findAll();
           return $query;
        }else{
           $query = $this->where('venta_id', $id)->findAll();