Proyecto_CLuciana/app/Controllers/AdminController.php

SELECT *
FROM `categorias`
---
    public function agregarProductoAdmin(){
        $categoria = new CategoriaModel();
        $data ['categorias'] = $categoria->findAll();

SELECT *
FROM `categorias`
SELECT *
FROM `producto`
JOIN `categorias` ON `categorias`.`categoria_id` = `producto`.`producto_categoria`
---
    public function gestionarProductosAdmin(){
        $producto_model = new ProductosModel();
        $categoria = new CategoriaModel();
        $data['categorias']= $categoria->findAll();
        $data['producto']= $producto_model->join('categorias', 'categorias.categoria_id = producto.producto_categoria')->findAll();