Proyecto_CLuciana/app/Controllers/UsuarioController.php

SELECT *
FROM `usuarios`
WHERE `usuario_email` = 'lucianacanteros2010@hotmail.com'
 LIMIT 1
---
    public function iniciarSesion(){
        $validation = \Config\Services::validation();
        $request = \Config\Services::request();
        $validation->setRules([
            'email' => 'required|valid_email',
            'contrasenia' => 'required|min_length[6]',
        ],
        [
            "email" => [
                "required" => 'El correo es obligatorio',
                "valid_email" => 'Este correo electrónico no existe',
            ],
            "contrasenia" => [
                "required" => 'La contraseña es obligatoria',
                'min_length' => 'Contraseña incorrecta'
            ],
        ]);

        if ((!$validation->withRequest($this->request)->run()) && ('usuario_estado' == 'no')) {
            return redirect()->back()->withInput()->with('errors',$validation->getErrors());
        } else {
            $request = \Config\Services::request();
            $session = session();

            $userModel = model('ModelUsuario');

            $email = $request->getPost('email');
            $contrasenia = $request->getPost('contrasenia');
            $usuario = $userModel->where('usuario_email', $email)->first();