Proyecto_CLuciana/app/Controllers/VentaController.php

    public function listarVentas(){
        $venta = new VentaModel();
        $data['title'] = 'Ventas';
        $data['ventas'] = $venta-> join('usuarios', 'usuarios.usuario_id = venta.usuario_id')->findAll();
---
SELECT *
FROM `venta`
JOIN `usuarios` ON `usuarios`.`usuario_id` = `venta`.`usuario_id`

    public function listarDetalleVentasController($id=NULL){
        $ventas = model('VentaModel');
        $data['venta'] = $ventas->where('venta_id', $id)->first();
---
SELECT *
FROM `venta`
WHERE `venta_id` = '1'
 LIMIT 1