Proyecto_CLuciana/app/Views/admin/detalleVenta.php

SELECT *
FROM `producto`
WHERE `producto_id` = '4'
 LIMIT 1
---
                    <?php foreach ($detalles as $detalle):?>
                    <?php
                        $productos = model ('ProductosModel');
                        $producto = $productos->where('producto_id',$detalle['id_producto'])->first();